[
  {
    "id": "02",
    "name": "Ms. Chesha P. Chellappan",
    "title": "Assistant Professor",
    "image": "/faculty/02.png",
    "description": [
      "Chesha P Chellappan is a legal professional with a robust educational and experiential background. She earned her B.A LL. B from His Highness the Maharaja’s Govt. Law College, Ernakulam affiliated to Mahatma Gandhi University and later pursued LL. M in Public Law & IPR from the Department of Law, Kerala University. She has cleared the UGC – NET Examination. Before delving into LL.M she gained practical experience as an Advocate.",
      "Chesha’s journey in academia led her to become an Assistant Professor at Mount Zion Law College, affiliated with Mahatma Gandhi University, Kerala. Her commitment to legal education shines through her engagement in various national and international seminars, workshops, round table conferences, and Faculty Development Programme. Her intellectual curiosity and interdisciplinary approach are evident from her participation as a valuator for the Young Innovators Programme, a unique initiative by the Kerala Development & Innovation Strategic Council (K-DISC). This role demonstrates her passion for fostering innovation within legal and educational spheres.",
      "She received an A+ grade in the Promotion of Excellence Among Gifted Students Programme from the General Education Department, Kerala, underscoring her outstanding academic achievements.Furthermore, Chesha’s contributions to projects under the aegis of the Kerala State Council for Science, Technology, and Education exemplify her dedication to collaborative efforts that bridge law with other domains, showcasing her versatility and ability to think beyond traditional boundaries.Chesha’s area of interest lies in Public Law, Family Law, Human Rights, and social Issues."
    ]
  },
  {
    "id": "03",
    "name": "Mr. Krishna Kishore Padala",
    "title": "Assistant Professor",
    "image": "/faculty/03.png",
    "description": [
      "Krishna Kishore holds a bachelor’s degree from Achrya Nagarjuna University and an LL.M in Labour Capital and Law from Andhra University. He is pursuing a doctoral degree in Labour Welfare Laws from Andhra University. He has cleared APSET and UGC – NET. Additionally, Krishna Kishore has an MBA (HR), M.Com, M.A. (Political Science), an MSW from the Centre for Distance Education, Acharya Nagarjuna University.",
      "Before starting his career in academics, he worked as a Project Coordinator with the Tribal Education and Rural Education Society, focused on tribal issues from a socio-legal context. Subsequently, he was an Assistant Professor at the Vikas Group of Institutions, and taught law subjects within the MBA programme. He has also attended various national and international conferences and has several publications in peer reviewed journals such as the International Education and Research Journal, Indian Journal of Law and Legal Journal, International Journal of Legal Science and Innovation, and Black White Legal. His areas of focus include child labour, comparative social security laws between countries, effectiveness in implementation of ESI Act, effective redressal of industrial disputes, prostitution, slavery and human trafficking."
    ]
  },
  {
    "id": "04",
    "name": "Ms. Sphurthi Krishna",
    "title": "Assistant Professor",
    "image": "/faculty/04.png",
    "description": [
     "Sphurthi Krishna holds a BA LL.B degree from JSS Law College, Mysore, which is affiliated with Karnataka State Law University. She then completed her LL.M from Amity University, Kolkata, specializing in Business Law, and was honored with a silver medal for her outstanding academic performance. Her strong dedication to values led her to receive the esteemed Shri Baljit Shastri Award for ‘Best in Human and Traditional Values’. Sphurthi also cleared the APSET examination and holds a UGC-NET qualification, further enhancing her academic achievements.",
     "Before entering academia, Sphurthi gained practical experience by practicing before the High Court of Hyderabad. She has worked in the legal and edutech sectors, focusing on career counseling and mentorship. Her active participation in national and international moot court competitions provided her with diverse legal exposure. She has authored articles for respected national and international journals, highlighting her commitment to sharing knowledge. Sphurthi’s dedication to growth is evident through her involvement in national seminars and conferences.",
     "Sphurthi’s research interests include Intellectual Property Rights, Women’s Jurisprudence, and Environmental Law. Over time, her interests have expanded to cover critical themes such as Gender Justice, Women and Law, and Socio-legal issues as part of her evolving journey."
    ]
  },
  {
    "id": "05",
    "name": "Dr. Gnana Sanga Mithra. S",
    "title": "Assistant Professor",
    "image": "/faculty/05.png",
    "description": [
     "Gnana Sanga Mithra S. holds a Bachelor’s and Master’s degree in Sociology, as well as a doctoral degree in Sociology with a specialization in Transgender Studies. Dr. Sanga Mithra is a dedicated researcher in the field of gender studies, with several published papers in Scopus (ID 57473599200) Indexed journals and active participation in numerous national and international conferences and seminars.",
     "During her academic career, she has held various leadership roles such as PRO in the Loyola Students Union and President of the Anti-harassment Cell at Loyola College. She was also elected as a Students Representative during her postgraduate studies and was recognized with the Star Performer Award for her exceptional contribution to the institution.",
     "Dr. Sanga Mithra’s significant research contributions have been recognized with various awards, including the Raman Research Cash Award by VIT, Chennai for the Best Research Paper published, and the Best Researcher award by University Putra Malaysia at Bodhi International Conference. Her outstanding leadership and service to the Transgender community led her to be recognized as a Situational Leader in the Educational sector.",
     "She is also an external resource person for various colleges and NGOs, and has been appointed to the editorial board of the International Journal of Law and Society. Her research interests lie in essentials of sociology, sociological theory, and gender studies. Dr. Sanga Mithra is a valuable asset to the academic community, and her research and leadership have been recognized on numerous occasions."
    ]
  },
  {
    "id": "06",
    "name": "Ms. Samudyata Sreenath",
    "title": "Assistant Professor",
    "image": "/faculty/main/07.png",
    "description": [
      "Samudyata Sreenath is an accomplished professional with a BA.LLB (Hons) from O. P. Jindal Global University and an MSc in Social Anthropology from the University of Oxford. She also spent time studying at the University of Tel Aviv, Israel. With her extensive training in both law and anthropology, Samudyata’s work focuses on exploring the intersections of law and culture, the state and social structures, systems of belief and collective political imaginations, etc.",
      "During her time at the University of Oxford, Samudyata’s research was centered around the symbolism used in Indian political rhetoric and the different forms of meaning these symbols invoked to mobilize large, disparate sections of the Indian population. Currently, her work focuses on understanding the affective motivations behind individual political constructions and the role of classrooms and pedagogy in shaping and molding these constructions.",
      "Before joining VMLS, Samudyata has gained valuable work experience in several reputed institutions including O.P. Jindal Global University and Dayananda Sagar University."
    ]
  },
  {
    "id": "07",
    "name": "Ms. Sinjini Sen",
    "title": "Assistant Professor",
    "image": "/faculty/main/08.png",
    "description": [
     "Sinjini Sen is a legal professional with a rich and varied background in the legal industry. Currently, Sinjini is pursuing a PhD from Rajiv Gandhi School of Intellectual Property Law, IIT Kharagpur, where her research focuses on the dynamic intersection of Intellectual Property Law and Health Regulation. Her keen interest in these fields stems from a profound belief in the importance of legal frameworks that shape innovation, safeguard public health. Holding BA LL.B (Hons) from University of Calcutta and LL.M from NLIU Bhopal, she has established herself in academia and beyond as an Intellectual Property Lawyer.",
     "Prior to her foray into academia, Sinjini garnered extensive industry experience through her associations with prestigious law firms such as Daswani and Daswani, D.P Ahuja and Krishnamurthy. Beyond her legal acumen, Sinjini holds a unique passion for classical dance and music, a facet that beautifully complements her intellectual pursuits."
    ]
  },
  {
    "id": "08",
    "name": "Dr. Debdulal Thakur",
    "title": "Professor of Economics & Public Policy",
    "image": "/faculty/main/09.png",
    "description": [
     "Dr. Debdulal Thakur is a distinguished public economist with a notable background as a life member of “The Indian Econometric Society” (TIES). With a career spanning 19 years, he possesses expertise in the areas of fiscal policy, budgets, urban finance, and economics of education. He has made significant contributions to these fields through extensive research and practical applications.",
     "During his career, he has been actively involved in co-authoring project-based reports funded by esteemed institutions such as the World Bank, UNDP, UNICEF, ADB, and DFID. These reports have primarily focused on budgets and public expenditure, with a particular emphasis on enhancing the fiscal and governance capabilities of urban local bodies in India.",
     "His academic pursuits have included positions as a regular faculty member at renowned institutions, namely NIPFP, BITS-Pilani, and Symbiosis. Prior to joining VMLS, he was a Senior Research Fellow with LEAD and also served as a visiting faculty member at the School of Interwoven Arts and Sciences (SIAS) within Krea University.",
     "Through his extensive experience, research contributions, and academic engagements, he has established himself as a respected authority in the realm of public economics. His work has significantly contributed to the understanding and advancement of fiscal policies, budgets, and the effective management of public resources."
    ]
  },
  {
    "id": "09",
    "name": "Ms. Nabeela Siddiqui",
    "title": "Assistant Professor",
    "image": "/faculty/main/06.png",
    "description": [
     "Ms. Nabeela Siddiqui is an accomplished academician with a strong focus on contemporary issues such as climate change, international water disputes, and cooperation. Throughout her impressive career, she has held esteemed positions at renowned institutions, including CHRIST (Deemed to be University), Dharamshastra National Law University (DNLU), and the National Green Tribunal, Principal Bench, New Delhi.",
     "Ms. Siddiqui’s dedication and commitment to her field have been recognized with prestigious honors, such as the President of India, Dr. Shankar Dayal Sharma Gold Medal, The Innes Prize, The Carmicheal Prize, and The V. Suresham Memorial Award, all of which she earned during her master’s program at the esteemed University of Madras, Chennai.",
     "As an avid researcher, Ms. Siddiqui has authored and co-authored numerous book chapters and articles, many of which are indexed in Scopus and listed in UGC CARE. Her expertise in legal matters and her insights into current affairs have garnered widespread recognition and she is a regular contributor to leading national newspapers and forums, including The Deccan Herald, The Hindu, Economic Political Weekly, Financial Express, among others."
    ]
  },
  {
    "id": "10",
    "name": "Ms. Gunjan Saxena",
    "title": "Assistant Professor",
    "image": "/faculty/main/10.png",
    "description": [
      "Prof. Gunjan Saxena is an Academician, Lawtech Innovator & Legal Designer, holding a Master of Law (LL.M.) in International Business Law from Queen Mary, University of London, and a B.A. LL.B. degree with honors from D. S. National Law University, Visakhapatnam, India.",
      "She is a member of the Legal Design Alliance and the Visual Contracts Community. She describes herself as a Lawyer by profession, an artist by passion, and a Legal Designer by their congruence. She is also the Co-founder & Innovation Lead of Legal Design Arc. She works passionately towards making accessibility a common phenomenon in the legal field. Apart from her passion for Legal Design, she holds a keen interest in International Trade and Investment Law, Digital Merger regimes, and Intellectual Property Law.",
      "She is the National President for the Intellectual Property Council at the Women’s India Chamber of Commerce and Industry (WICCI). Her work in the Legal Design and LawTech space is globally acknowledged. She holds the position of Assistant Professor at Vinayaka Mission’s Law School in Chennai. She previously worked with UPES Dehradun and held the position of Program Lead for their Law School for nearly three years.",
      "She has also been a Visiting Professor at Birkbeck University of London for the Comparative Law Classes. She chaired the Panel Discussion on “Tech for Techs” at the London Intellectual Property Week (LIPW) 4.0 organized by Cosmonauts. She is also the recipient of the prestigious “Best Achiever Award” by The Centre for Commercial Legal Studies (CCLS) of Queen Mary University of London (QMUL) India Chapter for the year 2020-2021. Her most recent publication is titled “Contemporary Themes in Intellectual Property Rights,” which is an edited volume" 
    ]
  },
  {
    "id": "11",
    "name": "Ms. Aarthy G.",
    "title": "Assistant Professor",
    "image": "/faculty/main/11.png",
    "description": [
      "Aarthy G. has a BA, LLB (Hons.) and an LLM from the School of Excellence in Law, The Tamil Nadu Dr. Ambedkar Law University. She has also completed an M.Sc. (Psychology) from TNOU, Chennai and she is currently pursuing a doctoral degree. She has previously worked at the Saveetha School of Law and the School of Law, Sathyabama University. She also briefly worked as an in-house counsel at VGP Corporate. Aarthy is a recipient of the Central Sector Scholarship for her Undergraduate Studies.",
      "During her undergraduate studies, Aarthy interned with the State Human Rights Commission. She was also appointed as a Rapporteur in the Regional Conference on Environment, by the National Green Tribunal, United Nations Environment Programme. Aarthy interned with the Archeological Survey of India, Ministry of Culture in the course of her postgraduate studies. She has participated and conducted many webinars, seminars and workshops. She has authored a novel and has published a number of articles in national and international journals. She is actively involved in environmental conservation, having spearheaded the Chennai Coastal Clean Up (CCC) initiative. She regularly volunteers with the Environmentalist Foundation of India and Blue Cross of India."
    ]
  },
  {
    "id": "12",
    "name": "Mr. Nishant Sheokand",
    "title": "Assistant Dean (Academic Affairs)",
    "image": "/faculty/main/12.png",
    "description": [
      "Nishant Sheokand is an award winning academician and an International Sports Lawyer, and advises Division B Football Clubs and sports management companies in Spain. Previously, he worked at the National Law University, Sonipat and O.P. Jindal Global University.",
      "Nishant has a Masters’ Degree in Sports Management and Legal Skills from the Instituto Superior de Derecho y Economía and Football Club Barcelona, Spain, where he received the Economist and Jurist Magazine, Difusion Juridica Scholarship and finished top of his class. He is an Advisor and Managing Editor for Global Sports Policy Review (GSPR) and Sportiva LLP, some of the leading Sports Law e-journals in India.",
      "He is admitted to the Delhi Bar Council since August, 2016. Nishant also was an in-house counsel for AL-Tech Global (Noida, U.P) between July 2016 and July 2017, and assisted them with their entry and expansion in the Indian market. Along with his academic achievements, Nishant was also awarded the Vice-Chancellor’s Outstanding Contribution Award and Ashwin Maharaj Best Footballer Award in 2016 for his performance in Sports and Sports-related matters.",
      "He had the opportunity to be a part of the founding team at Dr. B.R. Ambedkar National Law University, Sonipat, Haryana from June 2019 to June 2020. He worked as a Legal Advisor to the Vice-Chancellor. He was responsible for institution building initiatives and received an award for excellence and institution building in January 2020 from the Vice-Chancellor of the University.",
      "Nishant has been a professional cricket and football player and a published author. His work on euthanasia has been published a book edited by Justice Dipak Misra in 2019. He is passionate about Sports Law and has recently published a paper titled “Intersection of Islam and Modern Sports Law” in International Journal of Research and Review."
    ]
  },
  {
    "id": "13",
    "name": "Ms. Suhasini Rao",
    "title": "Associate Professor, Director, Centre for Justice Through Technology",
    "image": "/faculty/main/13.png",
    "description": [
      "Suhasini Rao is a lawyer and an entrepreneur, with a keen interest in instructional methodology and pedagogy. Her areas of interest include ethics and technology, public law, corporate governance and institution building.",
      "In the course of her career, she has worked with various corporate and consulting organisations focused on legal, educational, regulatory and compliance products, including ideation, creation and deployment. In 2015, she established a consulting firm with an interdisciplinary approach to business and management solutions.",
      "Suhasini is a Master Trainer, with over a decade of experience in interventions for public sector and corporate leadership, employees as well as the members of Internal Committees and Ethics Committees of organisations. She is a guest lecturer with the WDC, Govt. of Bihar, V.V. Giri National Labour Institute, Noida and the Central Bureau of Investigation Academy (Economic Offences), Ghaziabad. She is an editor with publishing houses and law firms, focusing on law and law-related publications, and frequently writes on a variety of law-centric subjects in newspapers, magazines and online fora."
    ]
  },
  {
    "id": "14",
    "name": "Mr. Edhaya Chandran",
    "title": "Assistant Professor",
    "image": "/faculty/main/14.png",
    "description": [
     "Edhaya Chandran is an academician with a keen interest in studying the development of subaltern politics in India. He completed his Masters degree in the stream of Political Science from Madras Christian College and cleared his NET in the year 2019. He specializes in western philosophy and his research thesis focuses on viewing democracy through the lens of continental philosophers. He co-founded an educational trust-Neelathazhal-to help underprivileged kids access education. He writes extensively on Subaltern Political Movements, Ethics, Gaming, pop culture, and philosophy."
    ]
  },
  {
    "id": "15",
    "name": "Mr. Anand Shrivas",
    "title": "Assistant Professor",
    "image": "/faculty/main/15.png",
    "description": [
     "Anand Shrivas is a highly accomplished mid-career academic who possesses a proven track record of work experience and academic achievement. His expertise lies in the field of Corporate and Financial Law, wherein he has developed a niche for himself. He is known for his unique and contemporary teaching pedagogies that make learning corporate and financial law simple, easy, and enjoyable.",
     "In his previous role as an Advisor to 9.9 (Group), New Delhi, Anand was responsible for spearheading the establishment of a new law school for BITS Pilani Group. He developed a pioneering curriculum that is futuristic for BITS Law School in Mumbai. Prior to this, he has worked with esteemed institutions such as National Law University Assam, Gujarat National Law University, and Maharashtra National Law University (MNLU). In addition to his teaching experience, Anand has a diverse background in working with law firms, Planning Commission, and management consultancy. Anand has been widely recognized for his contributions to the legal industry. He served as the Placement Officer at MNLU and runs a popular YouTube channel, “The Corporate Law Professor,” where he provides valuable insights and knowledge on Corporate Law for early career professionals.",
     "An alumnus of Hidayatullah National Law University and RTM Nagpur University, Anand is currently pursuing the Accelerated Management Programme at Harappa School of Leadership, founded by Prof. Pramath Raj Sinha."
    ]
  },
  {
    "id": "16",
    "name": "Mr. Saravanan R",
    "title": "Assistant Professor",
    "image": "/faculty/main/16.png",
    "description": [
     "Mr. Saravanan R has earned his LL.M in Maritime Law with distinction from Gujarat Maritime University (GMU). Within the GMU community, Mr. Saravanan significantly contributed to a research project entitled ‘GMU-ISWAN Joint Survey Research on issues related to recruitment and placement of Indian seafarers.’ His dedication extended beyond academia as he provided invaluable support to the National Human Rights Commission (NHRC) in the development of the ‘Handbook on the rights of the seafarers'.",
     "His dedication to education and exceptional ability to convey intricate concepts were evident during his tenure as a Teaching and Research Associate at GMU, where he delivered lectures to Naval officers in the Gujarat National Law University. He secured two separate full Scholarships and participated in ‘Global Forum on Maritime Labour Convention, 2006: Current and future developments – Third Edition 2022’ and in ‘Online Workshop on National Legal Implementation of the ILO Maritime Labour Convention, 2006 – 2022 Edition’ organized by the International Training Centre, of International Labour Organization in October and November 2022 respectively.",
     "His contributions to academia are notable, with the publication of four research papers in esteemed journals and magazines, including the National Law School of India University (NLSIU) Law magazine and NULAS CIPR’s The Intellectual Property Law Review."
    ]
  },
  {
    "id": "17",
    "name": "Ms. Shambhavi Thakur",
    "title": "Assistant Professor",
    "image": "/faculty/main/17.png",
    "description": [
      "Shambhavi Thakur holds a Master of Environmental Law from Melbourne Law",
      "School, University of Melbourne, Australia. She obtained her undergraduate degree in law from Jindal Global Law School, O.P. Jindal Global University, India. Her academic specialization lies in the fields of environmental law and public international law, while her intellectual curiosity extends to philosophy and art.",
      "With a steadfast commitment to social justice, she has garnered experience through her work and internships with esteemed institutions such as Bachpan Bachao Andolan, Centre for Justice, Law, and Society, Justice Ventures International, and Environmental Justice Australia. Furthermore, she has contributed her expertise to renowned educational institutions including the Oxford Scholastica Academy, United Kingdom, and IFIM Law School, India."
    ]
  },
  {
    "id": "18",
    "name": "Mr. Ananyo Mitra",
    "title": "Assistant Professor",
    "image": "/faculty/main/18.png",
    "description": [
     "Mr. Ananyo Mitra stands as a dedicated legal researcher and educator with a deep-seated passion for his field. He holds an LL.M degree in Public International Law from Queen Mary, University of London (Class of 2018), and a BBA. LLB from the School of Law, KIIT University (Class of 2017).",
     "Before his association with VMLS, Ananyo served as an Assistant Professor and also held the role of Assistant Dean (Research) at IFIM School of Law in Bengaluru. He boasts a valuable background, having worked and interned at esteemed research organizations, public sector undertakings (PSUs), and prominent law firms. Noteworthy among these are the Indian Law Institute, The Indian Society of International Law (ISIL), Asian African Legal Consultative Organization (AALCO), Coal India Ltd., and Fox & Mandal, Solicitors & Advocates.",
     "Ananyo’s proficiency in writing is evidenced by his numerous published articles and chapters in reputable legal journals and books. His research ambit encompasses a wide range of subjects including international law, environmental law, criminal law, jurisprudence, and human rights law."
    ]
  },
  {
    "id": "19",
    "name": "Dr. Fowmina",
    "title": "Assistant Professor",
    "image": "/faculty/main/19.png",
    "description": [
     "Dr. Fowmina. C holds a distinguished academic record, including a PhD in International Humanitarian Law from Vellore Institute of Technology, Chennai. Additionally, she possesses an LL.M degree in International Law, an M.A in Human Rights from the esteemed Indian Institute of Human Rights in New Delhi, and a degree in Criminal Justice from the University of East London. Her academic journey also includes a B.A.LLB from Bishop Cotton Women’s Christian College, Bangalore.",
     "With a wealth of educational qualifications, Dr. Fowmina brings a substantial scholarly background to her role. Prior to her engagement with VMLS, she served as an Assistant Professor at SRM School of Law and Bharath Institute of Law. She also contributed her expertise as a Visiting Faculty member at the School of Excellence in Chennai.",
     "Dr. Fowmina’s research accomplishments are evident through her inclusion in Scopus ID – 58199166800, which features several published works. She has further demonstrated her commitment to legal scholarship by serving as an Editor at The Law Brigade Publishers. Her intellectual contributions extend to numerous articles and chapters featured in reputable legal publications and books.",
     "Her research portfolio encompasses an array of significant themes, including international law, refugee law, women and children’s rights, Criminal Justice, and human rights law. Dr. Fowmina.C’s multifaceted expertise adds depth and distinction to her academic and professional profile."
    ]
  },
  {
    "id": "20",
    "name": "Dr. Nanthini R.O",
    "title": "Assistant Librarian",
    "image": "/faculty/main/20.png",
    "description": [
     "Dr. Nanthini has a B.A. in Journalism from M.O.P. Vaishnav College for Women, Chennai and has freelanced for various newspapers including The Hindu and Times of India for over a decade. She also has a B.L.I.S from Alagappa University. An avid reader, she then pursued a Master’s Degree in Library and Information Science (M.L.I.S) at Pondicherry University. Previously, Nanthini worked at the Study L’Ecole Internationale, Puducherry.",
     "She was instrumental in the classification and rearrangement of over 18,000 books in the higher secondary library for ease of access. She also developed a new primary school library catering to the needs of younger students. She cleared her UGC NET/JRF in December 2014 and completed her Ph.D through SRF-Full time, in Library and Information Sciences at Puducherry University. Her research focuses on the development of a new library classification scheme called the Indian School Library Classification.",
     "She is the founder Librarian of AVIL Library and has been continuously working towards creating the best resource facilitation for the patrons. Dr. Nanthini has several publications in national and international journals and has presented papers in several conferences. She is a member of the Society for Advancement of Library and Information Science (SALIS)."
    ]
  },
  {
    "id": "21",
    "name": "Ms. Merlin Stephen",
    "title": "Office Incharge Dean’s Office",
    "image": "/faculty/main/21.png",
    "description": [
     "Merlin Stephen currently holds the position of Officer In Charge at the Dean’s Office for the Law School of VMLS, where she oversees the comprehensive administrative functions of the department. With a distinguished career spanning over 27 years, she has amassed extensive administrative expertise in leading International Schools & Colleges. Her academic background comprises an M.Com. Degree, and she further honed her skills through a Post Graduate Diploma in Business Management from Stansfield School of Business in Singapore.",
     "Merlin’s professional journey boasts a remarkable association with several founding institutions, a testament to her pivotal role in establishing and nurturing educational initiatives. Her substantial experience and adeptness in administrative affairs make her a valued asset to the Law School of VMLS, as she effectively manages the multifaceted responsibilities inherent in her current role."
    ]
  },
  {
    "id": "22",
    "name": "Ms. Sheetal Mary",
    "title": "Manager - Students Affairs, Academic Planning & Communication and English Language Lab",
    "image": "/faculty/main/22.png",
    "description": [
     "With an extensive background spanning over 5 years in program management and government consulting, Sheetal brings a wealth of expertise to our team. She holds a bachelor’s degree in engineering from Anna University and has further enriched her academic journey with a postgraduate diploma in Liberal Studies from Ashoka University. Her educational pursuits reflect her dedication to continuous learning and growth. Throughout her career, Sheetal has made significant contributions to the education sector, actively engaging in diverse initiatives such as pre-service teacher education, language and literacy programs for primary schools, and the efficient management of higher education projects.",
     "During her tenure as a founding member of Sai University in Chennai, Sheetal assumed a pivotal role in shaping the institution’s trajectory. She was instrumental in crafting essential policies and optimizing processes for the Academic Affairs and Admissions office. Collaborating closely with faculty members, she played a crucial part in conceptualizing and establishing the Communications Lab and the Work and Well-being Lab.",
     "Before her engagement with Sai University, Sheetal’s professional journey included significant involvement in government consulting roles, where she actively collaborated with esteemed nonprofit organizations and governmental bodies in both Chennai and New Delhi.",
     "Her pursuit of knowledge was further amplified by her participation in a summer school program on Development Management and Research, a collaborative offering by Duke University and the Indian Institute of Management, Udaipur. Beyond her professional achievements, Sheetal has been an enthusiastic volunteer for various nonprofit organizations across India, contributing her expertise in content support, operations, and marketing."
    ]
  },
  {
    "id": "23",
    "name": "Mr. Hemanth Chandrashekar",
    "title": "Manager - People, Partnerships & Career Support",
    "image": "/faculty/main/23.png",
    "description": [
      "With a career spanning over two decades, Hemanth Chandrashekar brings a wealth of expertise in Talent Acquisition, Business Development, Marketing, Sales, Strategic Alliances, Account Management, and Client Servicing within the realms of Technology (Products/Services) and the Recruitment industry.",
      "Hemanth’s experience encompasses various dimensions, including Campus and Off-Campus recruitment, as well as Vertical and Volume hiring. He has demonstrated his proficiency in the Technology and Management sector by collaborating with distinguished companies such as HCL, ACS, NESS, Covansys, and CSC, catering to both the Indian and USA markets.",
      "Hemanth has a proactive leadership style and a knack for building things from the ground up. He’s especially passionate about EdTech startups and has a talent for creating supportive environments for new entrepreneurs. He holds a Bachelor of Science degree, specializing in Computer Science, earned from St. Joseph’s Arts and Science College in Bangalore."
    ]
  }
]